app/controllers/web_hooks_controller.rb

INSERT INTO "users" ("telegram_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["telegram_id", 449649326], ["created_at", "2017-06-17 20:11:12.421063"], ["updated_at", "2017-06-17 20:11:12.421063"]]
SELECT  "users".* FROM "users" WHERE "users"."telegram_id" = $1 LIMIT $2  [["telegram_id", 123389695], ["LIMIT", 1]]
---
  def telegram
    user_message = permitted_params[:text]
    user_id = permitted_params[:from][:id]
    chat_id = permitted_params[:from][:id]

    if DdosChecker.new(user_id).allow?
      chat = Chat.new(chat_id)
      chat.send_chat_action
      Bot.new(chat, User.find_or_create_by!(telegram_id: user_id), user_message).reply